MSG.title = "Webduino Blockly 關卡 4：按鈕控制 Youtube";
MSG.subTitle = "關卡 4：按鈕控制 Youtube";
MSG.demoDescription = "利用按鈕的行為，控制 Youtube 的播放、暫停和停止。";
MSG.stageHelp = "這個練習要利用按鈕來控制 Youtube 影片的播放、暫停、停止。\n\n因此在一開始你必須設定開發板、按鈕腳位、Youtube 模組，並且在網頁互動區顯示「開始」。\n\n接著設定當按鈕按下時，判斷 Youtube 影片狀態，如果是正在播放就讓它暫停 (互動區出現「暫停」文字)、暫停就讓它繼續播放 (互動區出現「繼續播放」文字)、播放完畢就讓它播放 (互動區出現「開始播放」文字)、尚未開始就讓它播放 (互動區出現「開始播放」文字)。\n\n另外請設定長按按鈕時，將所有動作停止，並且讓互動區出現「暫停」文字 (如果一個判別式無法處理大量需要判別的工作，可以試看看利用「如果」......「執行」積木左邊的齒輪試試看來加入更多判別喔！)。";
MSG.demoTitle = "網頁互動區";