MSG.title = "Webduino Blockly 关卡 4：按钮控制 Youtube";
MSG.subTitle = "关卡 4：按钮控制 Youtube";
MSG.demoDescription = "利用按钮的行为，控制 Youtube 的播放、暂停和停止。";
MSG.stageHelp = "这个练习要利用按钮来控制 Youtube 影片的播放、暂停、停止。\n\n因此在一开始你必须设定开发板、按钮脚位、Youtube 模组，并且在网页互动区显示「开始」。\n\n接著设定当按钮按下时，判断 Youtube 影片状态，如果是正在播放就让它暂停 (互动区出现「暂停」文字)、暂停就让它继续播放 (互动区出现「继续播放」文字)、播放完毕就让它播放 (互动区出现「开始播放」文字)、尚未开始就让它播放 (互动区出现「开始播放」文字)。\n\n另外请设定长按按钮时，将所有动作停止，并且让互动区出现「暂停」文字 (如果一个判别式无法处理大量需要判别的工作，可以试看看利用「如果」......「执行」积木左边的齿轮试试看来加入更多判别喔！)。";
MSG.demoTitle = "网页互动区";